tsungtests/company_critical_path.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
<clients>
<client host="localhost" use_controller_vm="true" maxusers="50000"/>
</clients>
<servers>
<server host="ec2-52-26-3-67.us-west-2.compute.amazonaws.com" port="80" type="tcp"></server>
</servers>
<load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="30" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
</load>
<options>
<option name="glocal_ack_timeout" value="2000"/>
<option type="ts_http" name="user_agent">
<user_agent probability="100">
Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4
</user_agent>
</option>
</options>
<sessions>
<session name="http-example" probability="100" type="ts_http">

	
	<setdynvars sourcetype="random_number" start="1" end="9999999">
		<var name="random_email_id"/>
	</setdynvars>
	<request subst="true">
		<dyn_variable name="edit_profile_url" re="Location: (http://.*)\r"/>
		<http 
			url="/users" 
			version="1.1"
			method="POST"
			contents='user%5Bemail%5D=random_email_%%_random_email_id%%%40gmail.com&amp;user%5Bpassword%5D=12345678&amp;user%5Bpassword_confirmation%5D=12345678&amp;user%5Bis_student%5D=true&amp;commit=Sign+up'>
		</http>
	</request>
	<!--- redirected to homepage! -->
	<request subst="true">
		<http
			url='/profiles'
			version='1.1'
			method='GET'>
		</http>
	</request>

	<!--- check the subscriptions -->
	<thinktime random='true' value='1'/>

	<!--- make new contract -->
	<request subst="true">
		<http
			url='/contracts/new'
			version='1.1'
			method='GET'>
		</http>
	</request>

	<!--- filling out the new contract form -->
	<thinktime random='true' value='30'/>
	
	<setdynvars sourcetype="random_number" start="20" end="1000">
		<var name="random_price"/>
	</setdynvars>
	<request subst="true">
		<http
			url="%%_contract_url%%"
			version="1.1"
			method="GET">
		</http>
	</request>
	<!--- searching for users -->
	<request subst="true">
		<http
			url="/profiles/search"
			version="1.1"
			method="GET">
		</http>
	</request>
	
	<!--- search for useres with ruby in description -->
	<request subst="true">
		<http
			url="/profiles/search?utf8=%E2%9C%93&amp;search=ruby&amp;commit=Search"
			version="1.1"
			method="GET">
		</http>
	</request>

	<!--- look at results users -->
	<thinktime random="true" value="5"/>
	
	<!--- go to random user profile -->
	<request subst="true">
		<http
			url="/profiles/1"
			version="1.1"
			method="GET">
		</http>
	</request>	
</session>
</sessions>
</tsung>