tsungtests/signup.xml
<tsung loglevel="notice" version="1.0">
<clients>
<client host="localhost" use_controller_vm="true" maxusers="50000"/>
</clients>
<servers>
<server host="ec2-52-25-38-159.us-west-2.compute.amazonaws.com" port="80" type="tcp"></server>
</servers>
<load>
<!--- just testing if sign up works -->
<arrivalphase phase="1" duration="2" unit="second">
        <users arrivalrate="1" unit="second"/>
</arrivalphase>
</load>
<options>
<option name="glocal_ack_timeout" value="2000"/>
<option type="ts_http" name="user_agent">
<user_agent probability="100">
Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4
</user_agent>
</option>
</options>
<sessions>
<session name="http-example" probability="100" type="ts_http">
        <setdynvars sourcetype="random_number" start="1" end="9999999">
                <var name="random_email_id"/>
        </setdynvars>
        <request subst="true">
                <http 
                        url="/users" 
                        version="1.1"
                        method="POST"
                        contents='user%5Bemail%5D=random_email_%%_random_email_id%%%40gmail.com&amp;user%5Bpassword%5D=12345678&amp;user%5Bpassword_confirmation%5D=12345678&amp;user%5Bis_student%5D=true&amp;commit=Sign+up'>
                </http>
        </request>

        <request subst="true">
                <http
                        url='/profiles/1'
                        version='1.1'
                        method='GET'>
                </http>
        </request>
</session>
</sessions>
</tsung>